Tekla Open API Reference for Tekla Structures 2025
DeformingData Properties
The DeformingData type exposes the following members.
Properties
Name | Description
Angle
 The angle of the part at its start point, relative to the part reference line.
For example, if the beam is warped 45 degrees at the end point, in the Angle field the value is 0, and the value is 45 in the Angle2 field.
Angle2
 The angle of the part at its end point, relative to the part reference line.
For example, if the beam is warped 45 degrees at the end point, in the Angle field the value is 0, and the value is 45 in the Angle2 field.
Cambering
 The degree of cambering.
Shortening
 The degree of shortening.
Top
See Also
Reference
DeformingData Class
Tekla.Structures.Model Namespace